<template>
  <div class="about">
    <div class="title">
      <h1>Lute 实现后记</h1>
    </div>
    <div class="cotent">
      <el-card>
        <p>Markdown 解析没有“报错”一说：无论是词法分析还是语法分析阶段，都不可能出现 error 退出。
        换句话说，对于编程语言而已，其在设计时就是准结构化的，甚至为了解析方便而特设语法（比如 golang 数据类型后置、模板中的表达式使用前缀表达式等），
        而 CM 则是为兼容各种写法、将各种写法规范化而设计的，所以规则非常多，目的是为了兼容而不是报错。
        整体解析方面比较难的是计算缩进宽度。缩进在 Markdown 中主要用于缩进代码块、列表项对齐。
        因为列表项作为块容器是可以容纳任何元素的（包括块级元素和行级元素），
        所以当列表项出现子块时缩进就要根据列表的定义来计算。比如要考虑列表标记宽度，标记后到第一个非空字符的空格数等。
        最麻烦的是块引用嵌套列表的场景，因为块引用也是一种块容器。
        </p>
        <p>Markdown 解析没有“报错”一说：无论是词法分析还是语法分析阶段，都不可能出现 error 退出。
        换句话说，对于编程语言而已，其在设计时就是准结构化的，甚至为了解析方便而特设语法（比如 golang 数据类型后置、模板中的表达式使用前缀表达式等），
        而 CM 则是为兼容各种写法、将各种写法规范化而设计的，所以规则非常多，目的是为了兼容而不是报错。
        整体解析方面比较难的是计算缩进宽度。缩进在 Markdown 中主要用于缩进代码块、列表项对齐。
        因为列表项作为块容器是可以容纳任何元素的（包括块级元素和行级元素），
        所以当列表项出现子块时缩进就要根据列表的定义来计算。比如要考虑列表标记宽度，标记后到第一个非空字符的空格数等。
        最麻烦的是块引用嵌套列表的场景，因为块引用也是一种块容器。
        </p>
        <p>Markdown 解析没有“报错”一说：无论是词法分析还是语法分析阶段，都不可能出现 error 退出。
        换句话说，对于编程语言而已，其在设计时就是准结构化的，甚至为了解析方便而特设语法（比如 golang 数据类型后置、模板中的表达式使用前缀表达式等），
        而 CM 则是为兼容各种写法、将各种写法规范化而设计的，所以规则非常多，目的是为了兼容而不是报错。
        整体解析方面比较难的是计算缩进宽度。缩进在 Markdown 中主要用于缩进代码块、列表项对齐。
        因为列表项作为块容器是可以容纳任何元素的（包括块级元素和行级元素），
        所以当列表项出现子块时缩进就要根据列表的定义来计算。比如要考虑列表标记宽度，标记后到第一个非空字符的空格数等。
        最麻烦的是块引用嵌套列表的场景，因为块引用也是一种块容器。
        </p>
        <p>Markdown 解析没有“报错”一说：无论是词法分析还是语法分析阶段，都不可能出现 error 退出。
        换句话说，对于编程语言而已，其在设计时就是准结构化的，甚至为了解析方便而特设语法（比如 golang 数据类型后置、模板中的表达式使用前缀表达式等），
        而 CM 则是为兼容各种写法、将各种写法规范化而设计的，所以规则非常多，目的是为了兼容而不是报错。
        整体解析方面比较难的是计算缩进宽度。缩进在 Markdown 中主要用于缩进代码块、列表项对齐。
        因为列表项作为块容器是可以容纳任何元素的（包括块级元素和行级元素），
        所以当列表项出现子块时缩进就要根据列表的定义来计算。比如要考虑列表标记宽度，标记后到第一个非空字符的空格数等。
        最麻烦的是块引用嵌套列表的场景，因为块引用也是一种块容器。
        </p>
      </el-card>
    </div>
  </div>
</template>

<script>
export default {
  name:'about',
  data(){
    return {
      content_detail:[]
    }
  },
  methods:{
    getContentDeatil(){
      let cid = this.$route.query.cid
      this.$axios.get('/api/content/'+ cid).then(res => {
        if(res.status === 200){
          this.content_detail = res.data.articles
        }
      })
    }
  },
  created(){
    this.getContentDeatil()
  }
}
</script>

<style lang="stylus" scoped>
.el-card{
  width :80%
  margin 0 auto
  margin-top 3rem
  line-height 1.6rem
  text-align: left;

}
</style>